# GetButton Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationService..::..GetButton Method
FabricationService Class See Also
---
Gets the service button for a given palette index and button index from the service.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public FabricationServiceButton GetButton(
	int paletteIndex,
	int buttonIndex
)
```

Visual Basic
---
```text
Public Function GetButton ( _
	paletteIndex As Integer, _
	buttonIndex As Integer _
) As FabricationServiceButton
```

Visual C++
---
```text
public:
FabricationServiceButton^ GetButton(
	int paletteIndex,
	int buttonIndex
)
```

# ### Parameters
paletteIndex
    Type: System..::..Int32 The palette index.
buttonIndex
    Type: System..::..Int32 The button index.
# ### Return Value
The service button.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The index paletteIndex is not larger or equal to 0 and less than PaletteCount. |

# See Also
FabricationService Class
Autodesk.Revit.DB Namespace